{"task_index": 0, "task": "Move blue cloth to the right of spoon."}
{"task_index": 1, "task": "Move the cloth so its to the right of the spoon"}
{"task_index": 2, "task": "move the blue spoon from the top of the purple cloth to the bottom part of the stove"}
{"task_index": 3, "task": "Put the spoon on the blue cloth"}
{"task_index": 4, "task": "Move the black object from the purple cloth to behind the blue spoon"}
{"task_index": 5, "task": "move the blue spoon to the left below the orange cloth"}
{"task_index": 6, "task": "Pick up the blue spoon and place it on the right of the orange cloth"}
{"task_index": 7, "task": "move blue cloth and place it near banana and spoon"}
{"task_index": 8, "task": "Move the spoon to the right of the cloth."}
{"task_index": 9, "task": "Move the spoon to the far edge of the table, next to the blue cloth and in front of the microwave."}
{"task_index": 10, "task": "Move the red spoon behind the purple cloth."}
{"task_index": 11, "task": "Place the spoon below the green cloth with the banana on it."}
{"task_index": 12, "task": "take the blue spoon and put it below the orange cloth"}
{"task_index": 13, "task": "Pick the spoon from the table cloth and put it one the side of the table."}
{"task_index": 14, "task": "Place the spoon on top of the blue cloth"}
{"task_index": 15, "task": "move the red spoon on the left side of the stove above the blue table cloth"}
{"task_index": 16, "task": "picked a red spoon and placed it on top of an orange cloth"}
{"task_index": 17, "task": "Move spoon to right of blue cloth."}
{"task_index": 18, "task": "Pick up the blue spoon and place it behind the green cloth"}
{"task_index": 19, "task": "Put the spoon closer to the cloth and pot."}
{"task_index": 20, "task": "put the blue spoon on top of the left burner and yellow cloth"}
{"task_index": 21, "task": "Move blue cloth straight over towards red spoon"}
{"task_index": 22, "task": "Move the spoon to the middle of the pan and blue cloth"}
{"task_index": 23, "task": "Put the blue cloth in between the pan and the red spoon"}
{"task_index": 24, "task": "Pick up the blue spoon and place it on the blue cloth"}
{"task_index": 25, "task": "Put the blue spoon on the yellow cloth"}
{"task_index": 26, "task": "Place the red spoon on the left side of the cloth"}
{"task_index": 27, "task": "Move the cloth left to the spoon tip."}
{"task_index": 28, "task": "Move orange cloth above blue spoon with bottom corner under handle"}
{"task_index": 29, "task": "Move green cloth to upper right of spoon, touching the spoon."}
{"task_index": 30, "task": "Move the cloth so its under the spoon"}
{"task_index": 31, "task": "Place the red spoon on the cloth."}
{"task_index": 32, "task": "Place the spoon in the space between the blue cloth and the can with the yellow label."}
{"task_index": 33, "task": "Place the blue spoon to the right of the cloth."}
{"task_index": 34, "task": "Pick up the spoon from the piece of cloth and place it near the steel pan."}
{"task_index": 35, "task": "Put the yellow cloth under the blue spoon"}
{"task_index": 36, "task": "Put the spoon on the green cloth."}
{"task_index": 37, "task": "keep blue spoon next to the violet cloth"}
{"task_index": 38, "task": "Put the spoon between the cloth and the mushroom."}
{"task_index": 39, "task": "Take the red spoon and put it on the yellow cloth."}
{"task_index": 40, "task": "Pick up the blue spoon and place it on the green cloth"}
{"task_index": 41, "task": "Place the blue cloth just left of the spoon."}
{"task_index": 42, "task": "move the blue spoon to the bottom of the yellow cloth"}
{"task_index": 43, "task": "Move the spoon to be partially on top of the cloth."}
{"task_index": 44, "task": "Move the spoon from the left to the right  and put it in top of the green cloth."}
{"task_index": 45, "task": "put the spoon to the cloth"}
{"task_index": 46, "task": "Move blue cloth to the left of spoon."}
{"task_index": 47, "task": "Move the red spoon beside the top left of the yellow cloth"}
{"task_index": 48, "task": "Pick up the red spoon on to of orange cloth and place it on its left"}
{"task_index": 49, "task": "place green spoon on the yellow cloth"}
{"task_index": 50, "task": "Move the blue cloth to the right side of the blue spoon."}
{"task_index": 51, "task": "moved the silver pot between the ladle spoon and blue cloth"}
{"task_index": 52, "task": "Set the spoon onto the orange cloth."}
{"task_index": 53, "task": "put blue spoon on the orange cloth"}
{"task_index": 54, "task": "Move the red spoon from the yellow cloth to table corner."}
{"task_index": 55, "task": "Move spoon to space between mushroom and blue cloth"}
{"task_index": 56, "task": "Put the spoon to the right of the cloth"}
{"task_index": 57, "task": "Put the spoon to the left of the cloth."}
{"task_index": 58, "task": "put the red spoon on the yellow cloth"}
{"task_index": 59, "task": "Place the green spoon onto the blue piece of cloth."}
{"task_index": 60, "task": "Place the spoon on the cloth."}
{"task_index": 61, "task": "move the yellow cloth on other side of pan near blue spoon"}
{"task_index": 62, "task": "put the blue spoon above the violet cloth"}
{"task_index": 63, "task": "Put red spoon on top of blue cloth"}
{"task_index": 64, "task": "Place the blue cloth directly left of the spoon."}
{"task_index": 65, "task": "Push the cloth to the left of the blue spoon"}
{"task_index": 66, "task": "Place the yellow spoon next to the blue cloth."}
{"task_index": 67, "task": "Move the spoon to the left of the blue cloth"}
{"task_index": 68, "task": "move the blue spoon on top of the orange cloth"}
{"task_index": 69, "task": "Pick up the blue spoon and put it on above the green cloth"}
{"task_index": 70, "task": "Place the orange cloth to the side of the blue spoon"}
{"task_index": 71, "task": "place the blue spoon on top of the orange cloth"}
{"task_index": 72, "task": "Move the table spoon from the green table cloth to the center of the table."}
{"task_index": 73, "task": "Move the yellow cloth near left side of the spoon."}
{"task_index": 74, "task": "place blue spoon on the orange cloth"}
{"task_index": 75, "task": "Move the spoon to the back of the table beside the cloth."}
{"task_index": 76, "task": "remove the blue spoon on the purple cloth and put it to the center of the table"}
{"task_index": 77, "task": "put the blue cup between the purple cloth and the blue spoon"}
{"task_index": 78, "task": "Move the red spoon just behind the pot on the cloth."}
{"task_index": 79, "task": "put the blue and grey spoon on the yelllow cloth"}
{"task_index": 80, "task": "put the blue cloth on the left side of the spoon"}
{"task_index": 81, "task": "Puts the cloth in between the pot and spoon."}
{"task_index": 82, "task": "Move spoon to green cloth, red handle hanging over bottom edge."}
{"task_index": 83, "task": "Move the spoon to the left of the purple cloth"}
{"task_index": 84, "task": "keep yellow spoon on the blue cloth"}
{"task_index": 85, "task": "place the spoon between the bowl and the cloth."}
{"task_index": 86, "task": "put the blue spoon on the orange cloth"}
{"task_index": 87, "task": "Pick up the blue spoon and place it on the yellow cloth"}
{"task_index": 88, "task": "Move the spoon with the robot and palce it on the blue cloth."}
{"task_index": 89, "task": "Move the spoon so the head is between the bowl and the cloth."}
{"task_index": 90, "task": "put the blue spoon on the red cloth"}
{"task_index": 91, "task": "Put the green object on top of the blue cloth touching spoon"}
{"task_index": 92, "task": "Pick up the spoon and place it in front of the blue cloth"}
{"task_index": 93, "task": "place the spoon on the cloth"}
{"task_index": 94, "task": "moved the red spoon above the black cloth"}
{"task_index": 95, "task": "move the tablespoon to the top of the blue cloth"}
{"task_index": 96, "task": "moved the ladle spoon beside the yellow cloth"}
{"task_index": 97, "task": "Move spoon to purple cloth, laying diagonal."}
{"task_index": 98, "task": "Move the spoon behind the green cloth."}
{"task_index": 99, "task": "Place the yellow spoon on the blue cloth."}
{"task_index": 100, "task": "Move the pot so its in between the spoon and the cloth."}
{"task_index": 101, "task": "Move the blue cloth to in front of the spoon."}
{"task_index": 102, "task": "Place red spoon on the green cloth"}
{"task_index": 103, "task": "Move the spoon to the left of the cloth."}
{"task_index": 104, "task": "Move red spoon to the left of yellow cloth"}
{"task_index": 105, "task": "Move the blue spoon to below the yellow cloth"}
{"task_index": 106, "task": "Move the cloth and spoon to the left edge of the table."}
{"task_index": 107, "task": "put spoon on top of the cloth"}
{"task_index": 108, "task": "move the blue spoon to the lower right corner of the blue cloth"}
{"task_index": 109, "task": "Move blue spoon and place onto cloth"}
{"task_index": 110, "task": "Pick up the red spoon and place it on the purple cloth"}
{"task_index": 111, "task": "Move the purple cloth to the right of the blue spoon"}
{"task_index": 112, "task": "Move spoon to middle of blue cloth."}
{"task_index": 113, "task": "Move the blue cloth in front of the microwave, next to the spoon."}
{"task_index": 114, "task": "Put the spoon on top of the blue cloth."}
{"task_index": 115, "task": "move the bread from the yellow cloth to the left between the spoon and bowl"}
{"task_index": 116, "task": "Place the spoon beside the orange cloth, near the right edge of the table."}
{"task_index": 117, "task": "place the bowl between the spoon and the cloth."}
{"task_index": 118, "task": "put the cloth between the spoon and pot."}
{"task_index": 119, "task": "Move the stirring spoon from the violet cloth."}
{"task_index": 120, "task": "Put the spoon on the left side of the yellow cloth."}
{"task_index": 121, "task": "Pick up the blue spoon and placed it on blue cloth"}
{"task_index": 122, "task": "put the blue spoon on the top of the green cloth"}
{"task_index": 123, "task": "Put the cloth next to the spoon"}
{"task_index": 124, "task": "Move the spoon to the left of the yellow cloth."}
{"task_index": 125, "task": "Place the yellow cloth to the front right of the table and to the right of the blue spoon."}
{"task_index": 126, "task": "Move the red spoon to the top side of the cloth."}
{"task_index": 127, "task": "Put the spoon to the left of the cloth"}
{"task_index": 128, "task": "Place the blue spoon onto the green cloth."}
{"task_index": 129, "task": "take the yellow spoon and place it on top of the cloth"}
{"task_index": 130, "task": "put the blue spoon on the cloth"}
{"task_index": 131, "task": "Put the spoon next to the cloth"}
{"task_index": 132, "task": "take the spoon from above the yellow cloth and move it to the upper right of the stove"}
{"task_index": 133, "task": "Move the yellow cloth to near the spoons"}
{"task_index": 134, "task": "take the green cloth and put it between the banana and the blue spoon"}
{"task_index": 135, "task": "Move the blue cloth to the right of the blue spoon"}
{"task_index": 136, "task": "place the blue spoon on the blue cloth"}
{"task_index": 137, "task": "take blue spoon and put it on top of the blue cloth"}
{"task_index": 138, "task": "Moved the spoon onto the orange cloth in the lower left corner."}
{"task_index": 139, "task": "move red spoon to far left of orange cloth"}
{"task_index": 140, "task": "Move pot on top of cloth so that head of spoon is touching it."}
{"task_index": 141, "task": "Grab the blue cloth that is in the middle to the left.  Move it slightly up and to the top left corner and place to the right of the spoon with yellow handle."}
{"task_index": 142, "task": "separate the blue object from the spoon and cloth"}
{"task_index": 143, "task": "moved the yellow cloth from the silver pot to in between the blue spoon and yellow cloth"}
{"task_index": 144, "task": "Pick up the blue spoon and place it on the left of the blue cloth"}
{"task_index": 145, "task": "moved the blue spoon between the blue cloth and the can"}
{"task_index": 146, "task": "Put the orange cloth next to the spoon."}
{"task_index": 147, "task": "Move the orange cloth in between the spoon and the pepper"}
{"task_index": 148, "task": "Move the blue spoon to the right side of the cloth"}
{"task_index": 149, "task": "Move the yellow cloth to the left of the red spoon."}
{"task_index": 150, "task": "Pick up the spoon and place it on the left of the green cloth"}
{"task_index": 151, "task": "Put the blue spoon onto the yellow cloth"}
{"task_index": 152, "task": "Move the cloth closer to the spoon almost touching."}
{"task_index": 153, "task": "Place the spoon on the orange cloth."}
{"task_index": 154, "task": "Place the red spoon on the left of the yellow cloth"}
{"task_index": 155, "task": "pick green spoon and drop it on the green cloth"}
{"task_index": 156, "task": "Move the yellow cloth to the left of the red spoon"}
{"task_index": 157, "task": "Move the cloth directly to the left of the spoon."}
{"task_index": 158, "task": "Move the Orange cloth near the red spoon."}
{"task_index": 159, "task": "Move the yellow spoon to the right of the blue cloth."}
{"task_index": 160, "task": "Place blue spoon on the blue cloth"}
{"task_index": 161, "task": "moves the red spoon from the cloth to the left side of the cloth"}
{"task_index": 162, "task": "put the plastic spoon on the yellow cloth"}
{"task_index": 163, "task": "Place the spoon on top of the blue cloth."}
{"task_index": 164, "task": "Pick the spoon up off the blue cloth and place it to the right of the metal pot, on the table."}
{"task_index": 165, "task": "Put the red spoon in between the pan and the cloth"}
{"task_index": 166, "task": "Put the red spoon on top of the blue cloth"}
{"task_index": 167, "task": "Put the blue spoon on the orange cloth"}
{"task_index": 168, "task": "Take the pot off the blue cloth and place it slightly behind the red spoon."}
{"task_index": 169, "task": "put the ladle spoon on top of the yellow cloth"}
{"task_index": 170, "task": "pick the red spoon and put it on violate kitchen cloth"}
{"task_index": 171, "task": "Move the pot to the right of the yellow cloth and in front of the red spoon."}
{"task_index": 172, "task": "move the spoon to the right of the cloth"}
{"task_index": 173, "task": "Move the silver pot next to pear between the green cloth and blue spoon"}
{"task_index": 174, "task": "Put the blue spoon in between the red object and the cloth"}
{"task_index": 175, "task": "move yellow cloth between the spoon and the can"}
{"task_index": 176, "task": "Pick up the spoon and place it on the blue cloth"}
{"task_index": 177, "task": "PLACE THE SPOON ON THE BLUE CLOTH"}
{"task_index": 178, "task": "Place the red spoon on the green cloth in the table."}
{"task_index": 179, "task": "Putting the spoon on the left side of the orange cloth."}
{"task_index": 180, "task": "Put the spoon on the cloth."}
{"task_index": 181, "task": "move the cloth so it's between the pot and spoon."}
{"task_index": 182, "task": "Move the green cloth in front of the blue spoon"}
{"task_index": 183, "task": "Put the spoon between the cloth and red object."}
{"task_index": 184, "task": "put the blue spoon on top of the orange cloth"}
{"task_index": 185, "task": "Pick up the spoon from the Orange cloth and place it onto the table."}
{"task_index": 186, "task": "Pick up the red spoon and place it on the right of the orange cloth"}
{"task_index": 187, "task": "Put the red spoon on the left side of the orange cloth"}
{"task_index": 188, "task": "put the blue spoon on the green cloth at the upper left side of the burner"}
{"task_index": 189, "task": "placed the blue-handled spoon to the left of the blue cloth"}
{"task_index": 190, "task": "Put the blue spoon to the right of the red cloth."}
{"task_index": 191, "task": "Move the yellow cloth to the right of the red spoon"}
{"task_index": 192, "task": "Put blue spoon on top of green cloth"}
{"task_index": 193, "task": "Move the red spoon to far left corner of the blue cloth."}
{"task_index": 194, "task": "Move the blue cloth upward really close to the yellow spoon."}
{"task_index": 195, "task": "pick the red spoon and put it on the blue cloth"}
{"task_index": 196, "task": "Place the spoon near the top-left corner of the cloth."}
{"task_index": 197, "task": "pick red spoon from ble cloth and place it near banana"}
{"task_index": 198, "task": "Move the blue cloth to the right of the red spoon"}
{"task_index": 199, "task": "Move spoon to left of pot, yellow cloth."}
{"task_index": 200, "task": "Place the blue-handled spoon between the pot and cloth, but closer to the pot."}
{"task_index": 201, "task": "Put the spoon to the left of the blue cloth"}
{"task_index": 202, "task": "moved spoon on top of the cloth"}
{"task_index": 203, "task": "Place the red spoon on the green cloth."}
{"task_index": 204, "task": "keep blue spoon on the yellow cloth"}
{"task_index": 205, "task": "Move the green cloth from left side of the table to right side of the table, below the red spoon."}
{"task_index": 206, "task": "Place the blue spoon on the orange cloth."}
{"task_index": 207, "task": "Move the green cloth and place it behind the blue spoon"}
{"task_index": 208, "task": "Place the spoon on top of the orange cloth."}
{"task_index": 209, "task": "Hold the spoon from above the blue cloth and place it right side of the table near stove."}
{"task_index": 210, "task": "Put the cloth under the spoon."}
{"task_index": 211, "task": "Pick up the red spoon and place it on the right of the blue cloth behind the green bell pepper"}
{"task_index": 212, "task": "Move the purple cloth above the pink-handled spoon."}
{"task_index": 213, "task": "Place the orange cloth between the spoon and the can."}
{"task_index": 214, "task": "move the light blue cloth to the lower right corner of the table below the light yellow spoon"}
{"task_index": 215, "task": "Move the red spoon from left side of the table near green cloth to right side edge of the table."}
{"task_index": 216, "task": "Move the spoon in between the pot and cloth"}
{"task_index": 217, "task": "move the blue cloth above the yellow spoon"}
{"task_index": 218, "task": "place the spoon between the cloth and the bowl."}
{"task_index": 219, "task": "move the object between the spoon and the blue cloth"}
{"task_index": 220, "task": "Place the pot between the spoon and the cloth."}
{"task_index": 221, "task": "Relocate the blue spoon to the right of the cloth."}
{"task_index": 222, "task": "Put the blue spoon in between but above the pan and cloth"}
{"task_index": 223, "task": "Place the blue spoon on the left side of blue cloth"}
{"task_index": 224, "task": "The cloth should be placed near the spoons."}
{"task_index": 225, "task": "Put the red spoon in between the pan and the green cloth"}
{"task_index": 226, "task": "put the red spoon on the purple cloth"}
{"task_index": 227, "task": "Move the spoon to top of the yellow cloth."}
{"task_index": 228, "task": "put red spoon on the green cloth"}
{"task_index": 229, "task": "the table has a violet cloth, a spoon and a plate"}
{"task_index": 230, "task": "Put the red spoon near the orange cloth."}
{"task_index": 231, "task": "pick red spoon and place it on the yellow cloth"}
{"task_index": 232, "task": "Pick up the red spoon and place it to the left of the yellow cloth"}
{"task_index": 233, "task": "Pick up the blue spoon and place it next to the yellow cloth."}
{"task_index": 234, "task": "move the spoon on top of the blue cloth"}
{"task_index": 235, "task": "Move the spoon to set partially on top of the cloth."}
{"task_index": 236, "task": "Place the spoon on the orange cloth"}
{"task_index": 237, "task": "pick the red spoon from the right burner and put above the blue cloth"}
{"task_index": 238, "task": "put the spoon on the purple cloth"}
{"task_index": 239, "task": "Put the blue spoon into the green cloth"}
{"task_index": 240, "task": "put the green spoon on top of the blue cloth"}
{"task_index": 241, "task": "Place the spoon on the blue cloth."}
{"task_index": 242, "task": "Place the spoon near the front edge of the table, in front of the blue cloth."}
{"task_index": 243, "task": "Move the spoon behind the blue cloth."}
{"task_index": 244, "task": "Move spoon to left of blue cloth."}
{"task_index": 245, "task": "Slide the green cloth to the left next to the spoon."}
{"task_index": 246, "task": "move the blue spoon to the top of the yellow cloth on the right corner of the stove"}
{"task_index": 247, "task": "Move the blue spoon to the left of the yellow cloth."}
{"task_index": 248, "task": "Pick up the blue spoon and place it on the orange cloth"}
{"task_index": 249, "task": "Move the green cloth beside the spoon and near the back left corner of the table."}
{"task_index": 250, "task": "put the spoon in the blue cloth"}
{"task_index": 251, "task": "Move the spoon in between the pot and the cloth and mushroom."}
{"task_index": 252, "task": "Move the red spoon over the blue cloth."}
{"task_index": 253, "task": "Move the spoon from the table cloth to the edge of the table."}
{"task_index": 254, "task": "Put the spoon on top of the cloth"}
{"task_index": 255, "task": "place the spoon over the bowl; to the right of the cloth."}
{"task_index": 256, "task": "put the orange spoon over the blue cloth and left burner"}
{"task_index": 257, "task": "Pick up the yellow spoon and move it onto the blue cloth."}
{"task_index": 258, "task": "picked a blue spoon and placed it on top of an orange cloth"}
{"task_index": 259, "task": "Move orange from cloth to between spoon and pot."}
{"task_index": 260, "task": "Move the cloth to the right of the spoon."}
{"task_index": 261, "task": "take brinjal on the yellow cloth and place it near blue spoon"}
{"task_index": 262, "task": "Move blue cloth so spoon touches the bottom right corner."}
{"task_index": 263, "task": "remove pan from cloth and keep it next to blue spoon handle"}
{"task_index": 264, "task": "Place the spoon on the top of the blue cloth."}
{"task_index": 265, "task": "move the cloth to the bottom of the table beside the spoon."}
{"task_index": 266, "task": "Move the spoon above the cloth."}
{"task_index": 267, "task": "Place the spoon above the blue cloth in the table."}
{"task_index": 268, "task": "put the blue spoon on top of the green cloth."}
{"task_index": 269, "task": "move the spoon to the back right corner of stove above cloth"}
{"task_index": 270, "task": "move red spoon to the far left above yellow cloth"}
{"task_index": 271, "task": "move the blue cloth above the red spoon on the upper right of burner"}
