{"task_index": 0, "task": "put eggplant on plate"}
{"task_index": 1, "task": "Place the eggplant on top of the yellow cloth."}
{"task_index": 2, "task": "moved the eggplant from the silver pot to the bottom right burner"}
{"task_index": 3, "task": "put eggplant into pan"}
{"task_index": 4, "task": "move the half eggplant to the upper right side of the burner."}
{"task_index": 5, "task": "take the eggplant and put it between the two right burners"}
{"task_index": 6, "task": "put eggplant in pot or pan"}
{"task_index": 7, "task": "Place eggplant on the purple cloth"}
{"task_index": 8, "task": "put eggplant into pot or pan"}
{"task_index": 9, "task": "Pick up the eggplant from pot put it on the table"}
{"task_index": 10, "task": "take the eggplant and put it between the two right bumers"}
{"task_index": 11, "task": "Move eggplant to front left edge of counter in front can"}
{"task_index": 12, "task": "Put the eggplant in the metal pot."}
{"task_index": 13, "task": "Place the silver bowl to the left of the purple eggplant"}
{"task_index": 14, "task": "take the eggplant out of the drawer and put it on the left side of the table"}
{"task_index": 15, "task": "move the eggplant to the bottom-left of the stove"}
{"task_index": 16, "task": "Put the blue spoon under the eggplant"}
{"task_index": 17, "task": "put eggplant on plate and largepotato in pot or pan in sink"}
{"task_index": 18, "task": "moved eggplant to back left corner"}
{"task_index": 19, "task": "put eggplant on towel"}
{"task_index": 20, "task": "moved the blue spoon in the middle of the table next to the eggplant"}
{"task_index": 21, "task": "Move the eggplant to the bottom-right corner of the counter."}
{"task_index": 22, "task": "move the eggplant to the left of the can"}
{"task_index": 23, "task": "take the eggplant and put it inside the drawer"}
{"task_index": 24, "task": "put the eggplant inside the silver pot"}
{"task_index": 25, "task": "put the eggplant at the top left of the right burner"}
{"task_index": 26, "task": "move the eggplant to the upper right of the burner"}
{"task_index": 27, "task": "put the eggplant in the pot and move the blue fork to the left side of the stove"}
{"task_index": 28, "task": "move the pot put on the eggplant"}
{"task_index": 29, "task": "Place the eggplant on the front left corner of the stove"}
{"task_index": 30, "task": "put the eggplant inside the drawer"}
{"task_index": 31, "task": "cover the purple eggplant from right to left"}
{"task_index": 32, "task": "Move the eggplant towards the upper left corner of counter."}
{"task_index": 33, "task": "Place the eggplant on the left of the blue cloth"}
{"task_index": 34, "task": "pick up the eggplant and place it to the left of the drawer"}
{"task_index": 35, "task": "put the eggplant in the drawer"}
{"task_index": 36, "task": "take the eggplant out of the silver pot and put it in the upper left corner of the table"}
{"task_index": 37, "task": "move the eggplant from the burner to the silver pot"}
{"task_index": 38, "task": "Move the blue spoon to in front of and to the right of the purple eggplant."}
{"task_index": 39, "task": "Move the purple eggplant to the right side of the right burner"}
{"task_index": 40, "task": "move somethingtake the eggplant and put it between the two right burners"}
{"task_index": 41, "task": "take the eggplant and put it on the aquamarine cloth"}
{"task_index": 42, "task": "Place the can to the left of the purple eggplant."}
{"task_index": 43, "task": "Place the eggplant  beneath the pot."}
{"task_index": 44, "task": "put the eggplant to the pot"}
{"task_index": 45, "task": "Place the eggplant between the pot and red fork"}
{"task_index": 46, "task": "put the eggplant on the front right side of the drawer"}
{"task_index": 47, "task": "Put the wing behind the eggplant."}
{"task_index": 48, "task": "place the eggplant on top of the green cloth"}
{"task_index": 49, "task": "Place eggplant on bottom of green cloth."}
{"task_index": 50, "task": "Put the red eggplant on the blue cloth."}
{"task_index": 51, "task": "Move the eggplant and put it in the bowl."}
{"task_index": 52, "task": "ake the eggplant and put it between the two right burners"}
{"task_index": 53, "task": "Place the eggplant on top of the blue towel"}
{"task_index": 54, "task": "Move the behind the pot with the eggplant"}
{"task_index": 55, "task": "pan take the eggplant and put it between the two right burners"}
{"task_index": 56, "task": "Place eggplant to the right of the chicken wing"}
{"task_index": 57, "task": "move the eggplant on top of the drawer on the left of bellpepper"}
{"task_index": 58, "task": "move the eggplant on the silver bowl"}
{"task_index": 59, "task": "put the eggplant in the middle of the spoon and fork"}
{"task_index": 60, "task": "put the eggplant in the silver pot"}
{"task_index": 61, "task": "Move the spoon below the pot with the eggplant"}
{"task_index": 62, "task": "Take the eggplant out of the pot and move it to the right of the fork."}
{"task_index": 63, "task": "Place the purple eggplant in the orange container."}
{"task_index": 64, "task": "Pick up the eggplant and put it in the silver bowl."}
{"task_index": 65, "task": "put the eggplant to the right corner of the table"}
{"task_index": 66, "task": "Put the eggplant on the cloth."}
{"task_index": 67, "task": "PICK UP THE EGGPLANT AND PUT ANOTHER SIDE OF THE TABLE"}
{"task_index": 68, "task": "Put the eggplant behind the can on the left"}
{"task_index": 69, "task": "take the eggplant and put it in the middle of the table"}
{"task_index": 70, "task": "Place the eggplant on the green cloth."}
{"task_index": 71, "task": "put eggplant on plate and spoon in pot or pan on stove"}
{"task_index": 72, "task": "put the purple eggplant on the right of the table"}
{"task_index": 73, "task": "moved the eggplant to the left side of the silver pan"}
{"task_index": 74, "task": "Place the red pepper below the purple eggplant."}
{"task_index": 75, "task": "Place eggplant at the bottom left corner"}
{"task_index": 76, "task": "Move orange cloth behind the red fork with the eggplant"}
{"task_index": 77, "task": "Place the eggplant in the saucepan"}
{"task_index": 78, "task": "Move the eggplant to the top-left corner of the table."}
{"task_index": 79, "task": "take the eggplant out of the pot and put it on the left burner"}
{"task_index": 80, "task": "Put the eggplant above the silver pot."}
{"task_index": 81, "task": "Move the can in front of the eggplant"}
{"task_index": 82, "task": "Move the eggplant from the pot to left side of the table."}
{"task_index": 83, "task": "put the eggplant in the middle of the spoon and carve"}
{"task_index": 84, "task": "move knife into basin take the eggplant and put it between the two right burners"}
{"task_index": 85, "task": "move the eggplant to left side of pot"}
{"task_index": 86, "task": "Move the eggplant to the right of the blue spoon."}
{"task_index": 87, "task": "Move silver bowl to right side of eggplant"}
{"task_index": 88, "task": "moves the eggplant to the button in between the burners"}
{"task_index": 89, "task": "move eggplant to between right burner"}
{"task_index": 90, "task": "Place the eggplant inside the orange pot"}
{"task_index": 91, "task": "put the eggplant on top of the green cloth"}
{"task_index": 92, "task": "move the eggplant from top of the drawer to the table"}
{"task_index": 93, "task": "put the eggplant inside the orange bowl"}
{"task_index": 94, "task": "take the eggplant and put it in the red cup at the left"}
